org-files/jinja.org
:PROPERTIES:
:ID:       4185090f-0488-404d-b2d0-1782cde99f7b
:END:
#+title: jinja
#+STARTUP: overview
#+date: 2024-01-14
#+hugo_custom_front_matter: :thumbnail "images/jinja.png"
#+setupfile: ./setup.conf
#+hugo_tags: jinja
#+hugo_categories: script
#+hugo_draft: false
Jinja2 es un motor de plantillas para el lenguaje de programación Python. Fue creado por Armin Ronacher y se utiliza comúnmente en aplicaciones web basadas en Python para generar contenido dinámico. Jinja2 permite la creación de plantillas que contienen marcadores de posición y lógica de control, que luego pueden ser llenados con datos específicos cuando se renderiza la plantilla.
#+BEGIN_export html
<!--more-->
#+END_export
Estos son los conocimientos que he ido adquiriendo sobre jinja 2 para Home Assistant.

Mi uso se restringe básicamente a la generación de plantillas para [[id:9ceae31a-8fb3-4f1b-b793-0a6d045f3862][Home Assistant]]. Puedes ver como lo he utilizado en la generación de [[https://github.com/sherlockes/ha_cfg/blob/main/sensors.yaml][sensores]] y [[https://github.com/sherlockes/ha_cfg/blob/main/binary_sensors.yaml][sensores binarios]] virtuales. 

** Entidades
- Obtener las entidades de una integración ~{{ integration_entities('<integración>') }}~
- Obtener el atributo de una entidad ~{{ state_attr('<entidad>', '<atributo>') }}~
- Obtener el estado de una entidad ~states('<entidad>')~
-----
** Bucles
 - If
   #+begin_src jinja2
{% if <condicion_1> %}
Resultado 1
{% elif <condicion_2> %}
Resultado 2
{% else %}
Resultado 3
{% endif %}
   #+end_src
 - If not
   #+begin_src jinja2
{% if not <condicion_1> %}
Resultado 1
{% endif %}
   #+end_src
 - For
   #+begin_src jinja2
{% for <elemento> in <rango> %}
  ...
{% endfor %}
   #+end_src
-----   
** Listas
#+begin_src jinja
{% lista = namespace(numbers=[]) %}
{% set lista.numbers = precios.numbers + [precio] %}
#+end_src
** Manejo de horas y fechas
 - Ahora ~{{ now() }}~
 - Ahora (solo fecha) ~{{ now().date() }}~
 - Ahora (solo hora) ~{{ now().hour }}~
 - Convertir a segundos ~{{ as_timestamp(<fecha>) }}~
 - Incrementar un día ~{{ (now() + timedelta(days=1)) }}~
 - Día de la semana ~{{ (<fecha>).strftime('%w') }}~
 - Día de la semana ~{{ as_timestamp(<fecha>) | timestamp_custom('%w') }}~
 - De lunes a viernes ~{{ (<fecha>).strftime('%w') | int in range(1, 6) }}~
 - Despreciar segundos ~{{ now().replace(hour=8, minute=0, second=0, microsecond=0) }}~
 - Texto a fecha ~as_datetime('YYYY-MM-DDTHH:MM:SS')~
 - Reemplazar ~{{ as_datetime('2023-05-21').replace(hour=8, minute=0, second=0, microsecond=0) }}~
-----
** Operaciones
- length -> Elementos de un rango o lista
- int -> Convierte a entero
- float -> Convierte a decimal
- max -> devuelve el valor máximo de una lista
- min -> devuelve el valor mínimo de una lista
-----
** Rangos
 - Desde hasta ~{{ <number> | int in range(1, 6) }}~
 - Valores ~{{ <number> | int in ["1", "2", "6") }}~
-----
** Ejemplos
*** Incremento de tiempo
Añade al ayudante "input_datetime.tv_off_kids" 60 segundos

#+begin_src jinja2
{{(((state_attr('input_datetime.tv_off_kids' , 'timestamp')) + 60) |
    timestamp_custom('%H:%M', false))}}
#+end_src

#+begin_quote
Si en la función "timestamp_custom" ponemos "true" como segundo parámetro tenemos que restar 3600 sg (1 hora) a los 60 segundos para obtener el resultado adecuado. Para conseguir la hora local hay que poner este argumento a "false".
#+end_quote

Si queremos restar un número de minutos definido por el ayudante "counter.malos_habitos" modificaremos la función anterior quedando lo siguiente.

#+begin_src jinja2
  {{(((state_attr('input_datetime.tv_off_kids' , 'timestamp')) - (60 * ((states('counter.malos_habitos') | float)))) |
    timestamp_custom('%H:%M', false))}}
#+end_src
-----
