public_html/jinja.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-03-20 vie 12:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>jinja</title>
<meta name="author" content="Sherlockes" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='https://gongzhitaao.org/orgcss/org.css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">jinja</h1>
<p>
Jinja2 es un motor de plantillas para el lenguaje de programación Python. Fue creado por Armin Ronacher y se utiliza comúnmente en aplicaciones web basadas en Python para generar contenido dinámico. Jinja2 permite la creación de plantillas que contienen marcadores de posición y lógica de control, que luego pueden ser llenados con datos específicos cuando se renderiza la plantilla.
</p>

<p>
Estos son los conocimientos que he ido adquiriendo sobre jinja 2 para Home Assistant.
</p>

<p>
Mi uso se restringe básicamente a la generación de plantillas para [BROKEN LINK: 9ceae31a-8fb3-4f1b-b793-0a6d045f3862]. Puedes ver como lo he utilizado en la generación de <a href="https://github.com/sherlockes/ha_cfg/blob/main/sensors.yaml">sensores</a> y <a href="https://github.com/sherlockes/ha_cfg/blob/main/binary_sensors.yaml">sensores binarios</a> virtuales. 
</p>

<div id="outline-container-orgca8cce6" class="outline-2">
<h2 id="orgca8cce6"><span class="section-number-2">1.</span> Entidades</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Obtener las entidades de una integración <code>{{ integration_entities('&lt;integración&gt;') }}</code></li>
<li>Obtener el atributo de una entidad <code>{{ state_attr('&lt;entidad&gt;', '&lt;atributo&gt;') }}</code></li>
<li>Obtener el estado de una entidad <code>states('&lt;entidad&gt;')</code></li>
</ul>
<hr />
</div>
</div>
<div id="outline-container-org0424e89" class="outline-2">
<h2 id="org0424e89"><span class="section-number-2">2.</span> Bucles</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><p>
If
</p>
<div class="org-src-container">
<pre class="src src-jinja2">{% if &lt;condicion_1&gt; %}
Resultado 1
{% elif &lt;condicion_2&gt; %}
Resultado 2
{% else %}
Resultado 3
{% endif %}
</pre>
</div></li>
<li><p>
If not
</p>
<div class="org-src-container">
<pre class="src src-jinja2">{% if not &lt;condicion_1&gt; %}
Resultado 1
{% endif %}
</pre>
</div></li>
<li><p>
For
</p>
<div class="org-src-container">
<pre class="src src-jinja2">{% for &lt;elemento&gt; in &lt;rango&gt; %}
  ...
{% endfor %}
</pre>
</div></li>
</ul>
<hr />
</div>
</div>
<div id="outline-container-org8a515de" class="outline-2">
<h2 id="org8a515de"><span class="section-number-2">3.</span> Listas</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-jinja">{% lista = namespace(numbers=[]) %}
{% set lista.numbers = precios.numbers + [precio] %}
</pre>
</div>
</div>
</div>
<div id="outline-container-org402c2e7" class="outline-2">
<h2 id="org402c2e7"><span class="section-number-2">4.</span> Manejo de horas y fechas</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Ahora <code>{{ now() }}</code></li>
<li>Ahora (solo fecha) <code>{{ now().date() }}</code></li>
<li>Ahora (solo hora) <code>{{ now().hour }}</code></li>
<li>Convertir a segundos <code>{{ as_timestamp(&lt;fecha&gt;) }}</code></li>
<li>Incrementar un día <code>{{ (now() + timedelta(days=1)) }}</code></li>
<li>Día de la semana <code>{{ (&lt;fecha&gt;).strftime('%w') }}</code></li>
<li>Día de la semana <code>{{ as_timestamp(&lt;fecha&gt;) | timestamp_custom('%w') }}</code></li>
<li>De lunes a viernes <code>{{ (&lt;fecha&gt;).strftime('%w') | int in range(1, 6) }}</code></li>
<li>Despreciar segundos <code>{{ now().replace(hour=8, minute=0, second=0, microsecond=0) }}</code></li>
<li>Texto a fecha <code>as_datetime('YYYY-MM-DDTHH:MM:SS')</code></li>
<li>Reemplazar <code>{{ as_datetime('2023-05-21').replace(hour=8, minute=0, second=0, microsecond=0) }}</code></li>
</ul>
<hr />
</div>
</div>
<div id="outline-container-org2b9d87b" class="outline-2">
<h2 id="org2b9d87b"><span class="section-number-2">5.</span> Operaciones</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>length -&gt; Elementos de un rango o lista</li>
<li>int -&gt; Convierte a entero</li>
<li>float -&gt; Convierte a decimal</li>
<li>max -&gt; devuelve el valor máximo de una lista</li>
<li>min -&gt; devuelve el valor mínimo de una lista</li>

<li>== -&gt; iguales</li>
<li>!= -&gt; diferentes</li>
</ul>
<hr />
</div>
</div>
<div id="outline-container-org7698091" class="outline-2">
<h2 id="org7698091"><span class="section-number-2">6.</span> Rangos</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Desde hasta <code>{{ &lt;number&gt; | int in range(1, 6) }}</code></li>
<li>Valores <code>{{ &lt;number&gt; | int in ["1", "2", "6") }}</code></li>
</ul>
<hr />
</div>
</div>
<div id="outline-container-org27baf2f" class="outline-2">
<h2 id="org27baf2f"><span class="section-number-2">7.</span> Ejemplos</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org65fdedc" class="outline-3">
<h3 id="org65fdedc"><span class="section-number-3">7.1.</span> Incremento de tiempo</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Añade al ayudante "input<sub>datetime.tv</sub><sub>off</sub><sub>kids</sub>" 60 segundos
</p>

<div class="org-src-container">
<pre class="src src-jinja2">{{(((state_attr('input_datetime.tv_off_kids' , 'timestamp')) + 60) |
    timestamp_custom('%H:%M', false))}}
</pre>
</div>

<blockquote>
<p>
Si en la función "timestamp<sub>custom</sub>" ponemos "true" como segundo parámetro tenemos que restar 3600 sg (1 hora) a los 60 segundos para obtener el resultado adecuado. Para conseguir la hora local hay que poner este argumento a "false".
</p>
</blockquote>

<p>
Si queremos restar un número de minutos definido por el ayudante "counter.malos<sub>habitos</sub>" modificaremos la función anterior quedando lo siguiente.
</p>

<div class="org-src-container">
<pre class="src src-jinja2">{{(((state_attr('input_datetime.tv_off_kids' , 'timestamp')) - (60 * ((states('counter.malos_habitos') | float)))) |
  timestamp_custom('%H:%M', false))}}
</pre>
</div>
<hr />
</div>
</div>
