content/notas/jinja.md
+++
title = "jinja"
author = ["Sherlockes"]
date = 2024-01-14
lastmod = 2024-06-05T18:20:12+02:00
tags = ["jinja"]
categories = ["script"]
draft = false
weight = 5
thumbnail = "images/jinja.png"
toc = true
+++

Jinja2 es un motor de plantillas para el lenguaje de programación Python. Fue creado por Armin Ronacher y se utiliza comúnmente en aplicaciones web basadas en Python para generar contenido dinámico. Jinja2 permite la creación de plantillas que contienen marcadores de posición y lógica de control, que luego pueden ser llenados con datos específicos cuando se renderiza la plantilla.

<!--more-->

Estos son los conocimientos que he ido adquiriendo sobre jinja 2 para Home Assistant.

Mi uso se restringe básicamente a la generación de plantillas para [Home Assistant]({{< relref "iot.md" >}}). Puedes ver como lo he utilizado en la generación de [sensores](https://github.com/sherlockes/ha_cfg/blob/main/sensors.yaml) y [sensores binarios](https://github.com/sherlockes/ha_cfg/blob/main/binary_sensors.yaml) virtuales.


## Entidades {#entidades}

-   Obtener las entidades de una integración `{{ integration_entities('<integración>') }}`
-   Obtener el atributo de una entidad `{{ state_attr('<entidad>', '<atributo>') }}`
-   Obtener el estado de una entidad `states('<entidad>')`

---


## Bucles {#bucles}

-   If
    ```jinja2
    {% if <condicion_1> %}
    Resultado 1
    {% elif <condicion_2> %}
    Resultado 2
    {% else %}
    Resultado 3
    {% endif %}
    ```
-   If not
    ```jinja2
    {% if not <condicion_1> %}
    Resultado 1
    {% endif %}
    ```
-   For
    ```jinja2
    {% for <elemento> in <rango> %}
      ...
    {% endfor %}
    ```

---


## Listas {#listas}

```jinja
{% lista = namespace(numbers=[]) %}
{% set lista.numbers = precios.numbers + [precio] %}
```


## Manejo de horas y fechas {#manejo-de-horas-y-fechas}

-   Ahora `{{ now() }}`
-   Ahora (solo fecha) `{{ now().date() }}`
-   Ahora (solo hora) `{{ now().hour }}`
-   Convertir a segundos `{{ as_timestamp(<fecha>) }}`
-   Incrementar un día `{{ (now() + timedelta(days=1)) }}`
-   Día de la semana `{{ (<fecha>).strftime('%w') }}`
-   Día de la semana `{{ as_timestamp(<fecha>) | timestamp_custom('%w') }}`
-   De lunes a viernes `{{ (<fecha>).strftime('%w') | int in range(1, 6) }}`
-   Despreciar segundos `{{ now().replace(hour=8, minute=0, second=0, microsecond=0) }}`
-   Texto a fecha `as_datetime('YYYY-MM-DDTHH:MM:SS')`
-   Reemplazar `{{ as_datetime('2023-05-21').replace(hour=8, minute=0, second=0, microsecond=0) }}`

---


## Operaciones {#operaciones}

-   length -&gt; Elementos de un rango o lista
-   int -&gt; Convierte a entero
-   float -&gt; Convierte a decimal
-   max -&gt; devuelve el valor máximo de una lista
-   min -&gt; devuelve el valor mínimo de una lista

---


## Rangos {#rangos}

-   Desde hasta `{{ <number> | int in range(1, 6) }}`
-   Valores `{{ <number> | int in ["1", "2", "6") }}`

---


## Ejemplos {#ejemplos}


### Incremento de tiempo {#incremento-de-tiempo}

Añade al ayudante "input_datetime.tv_off_kids" 60 segundos

```jinja2
{{(((state_attr('input_datetime.tv_off_kids' , 'timestamp')) + 60) |
    timestamp_custom('%H:%M', false))}}
```

> Si en la función "timestamp_custom" ponemos "true" como segundo parámetro tenemos que restar 3600 sg (1 hora) a los 60 segundos para obtener el resultado adecuado. Para conseguir la hora local hay que poner este argumento a "false".

Si queremos restar un número de minutos definido por el ayudante "counter.malos_habitos" modificaremos la función anterior quedando lo siguiente.

```jinja2
{{(((state_attr('input_datetime.tv_off_kids' , 'timestamp')) - (60 * ((states('counter.malos_habitos') | float)))) |
  timestamp_custom('%H:%M', false))}}
```

---
