org-files/jinja.org
*** Encendido de la calefacción entre dos horas
Tenemos dos ayudantes, (hora de encender y hora de apagar) entre las cuales el resultado de la función deberá ser "on", "off" en el resto de horario"

#+begin_src jinja2
  {% set hora_actual = now().strftime('%H:%M') %}
  {% set hora_encendido = states('input_datetime.calefaccion_hora_de_encender') %}
  {% set hora_apagado = states('input_datetime.calefaccion_hora_de_apagar') %}
  {% set temperatura_exterior = states('sensor.temperatura_exterior') | float %}
  {{ 'on' if hora_encendido <= hora_actual < hora_apagado and temperatura_exterior < 15 else 'off' }}
#+end_src
-----
*** Determinar si mañana hay cole
- Hay un calendario (calendar.festivos_escolares) con los días festivos
- Hay un ayudante (input_boolean.hay_cole_manana) que almacena el valor
- Hay un script (Cole mañana) que recoge los eventos del calendario de las próximas 24 horas y lo guarda en la variable (agenda_calendario)
  
En un primer momento parece obvio que si mañana es sábado o domingo no habrá cole

Con esto necesitamos una plantilla para que, a partir de "calendar.festivos_escolares" devuelva "true" si mañana hay cole o "false" si no lo hay. Habrá cole si:
- No hay ningún evento en el calendario
- El evento que hay termina antes de mañana (Hoy no es lectivo pero mañana si)

#+begin_src jinja2
{# Define tomorrow como la fecha de mañana a estas horas #}
{% set tomorrow = as_timestamp((now() + timedelta(days=1)).date()) %}

{# Si mañana no es de lunes a viernes, false, no hay cole #}
{% if not (now() + timedelta(days=1)).strftime('%w') | int in range(1, 6) %}
  false
{# Si mañana no hay ningún evento en "festivos_escolares", true, hay cole #}
{% elif not agenda_calendario["calendar.festivos_escolares"]["events"] %}
  true
{% else %}
  {% for event in agenda_calendario["calendar.festivos_escolares"]["events"] %}
    {% set event_end = as_timestamp(strptime(event.end, "%Y-%m-%d")) %}
    {# Si para mañana se ha terminado el evento, true, hay cole #}
    {% if tomorrow > event_end %}
      true
      {% break %}
    {% else %}
      false
    {% endif %}
  {% endfor %}
{% endif %}
#+end_src
-----
*** Las persianas de casa
**** Bajar las persianas cuando levanta el sol y hace calor
Hay que determinar cuando está levantando el sol y hace el suficiente calor dentro o fuera de casa
- Elevación del sol entre 21º y 50º
- La hora menor de las 14:00 para despreciar cuando se esconde el sol
- Temperatura interior o exterior por encima de 23 ºC
  
#+begin_src jinja2
{% set elev = 21 < state_attr('sun.sun', 'elevation') < 50 %}
{% set hora = now().hour < 14 %}
{% set exterior_temperature = states('sensor.temperatura_exterior') | float %}
{% set salon_temperature = states('sensor.temperatura_salon') | float %}
{% set temp = exterior_temperature > 23 or salon_temperature > 23 %}
{{ elev and hora and temp }}
#+end_src
**** Bajar las persianas cuando hace frío y se esconde el sol
#+begin_src jinja2
{% set ta_minima = states('sensor.aemet_daily_forecast_temperature_low') | float %}
{% set sun_elevation = state_attr('sun.sun', 'elevation') %}
{% set exterior_temperature = states('sensor.temperatura_exterior') | float %}
{{ sun_elevation < -5 and now().hour < 22 and (ta_minima < 10 or exterior_temperature < 14) }}
#+end_src
-----
**** Cuando el sol está entrando por una ventana
En función de la altura del sol, el acimut, la consigna de temperatura de la caldera  y la temperatura exterior, esta plantilla devuelve verdadero cuando el sol está entrando por una ventana.
#+begin_src jinja
{% set cal = state_attr('climate.caldera', 'temperature' ) + 4 %}
{% set temp = states('sensor.temperatura_exterior')|int %}
{% set ele = state_attr('sun.sun', 'elevation') %}
{% set azi = state_attr('sun.sun', 'azimuth') %}
{{ temp > cal and azi > 230 and ele > 45 }}
#+end_src
-----
