public_html/jinja.html
<div id="outline-container-orgf356227" class="outline-3">
<h3 id="orgf356227"><span class="section-number-3">7.2.</span> Encendido de la calefacción entre dos horas</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Tenemos dos ayudantes, (hora de encender y hora de apagar) entre las cuales el resultado de la función deberá ser "on", "off" en el resto de horario"
</p>

<div class="org-src-container">
<pre class="src src-jinja2">{% set hora_actual = now().strftime('%H:%M') %}
{% set hora_encendido = states('input_datetime.calefaccion_hora_de_encender') %}
{% set hora_apagado = states('input_datetime.calefaccion_hora_de_apagar') %}
{% set temperatura_exterior = states('sensor.temperatura_exterior') | float %}
{{ 'on' if hora_encendido &lt;= hora_actual &lt; hora_apagado and temperatura_exterior &lt; 15 else 'off' }}
</pre>
</div>
<hr />
</div>
</div>
<div id="outline-container-org82b4fd8" class="outline-3">
<h3 id="org82b4fd8"><span class="section-number-3">7.3.</span> Determinar si mañana hay cole</h3>
<div class="outline-text-3" id="text-7-3">
<ul class="org-ul">
<li>Hay un calendario (calendar.festivos<sub>escolares</sub>) con los días festivos</li>
<li>Hay un ayudante (input<sub>boolean.hay</sub><sub>cole</sub><sub>manana</sub>) que almacena el valor</li>
<li>Hay un script (Cole mañana) que recoge los eventos del calendario de las próximas 24 horas y lo guarda en la variable (agenda<sub>calendario</sub>)</li>
</ul>

<p>
En un primer momento parece obvio que si mañana es sábado o domingo no habrá cole
</p>

<p>
Con esto necesitamos una plantilla para que, a partir de "calendar.festivos<sub>escolares</sub>" devuelva "true" si mañana hay cole o "false" si no lo hay. Habrá cole si:
</p>
<ul class="org-ul">
<li>No hay ningún evento en el calendario</li>
<li>El evento que hay termina antes de mañana (Hoy no es lectivo pero mañana si)</li>
</ul>

<div class="org-src-container">
<pre class="src src-jinja2">{# Define tomorrow como la fecha de mañana a estas horas #}
{% set tomorrow = as_timestamp((now() + timedelta(days=1)).date()) %}

{# Si mañana no es de lunes a viernes, false, no hay cole #}
{% if not (now() + timedelta(days=1)).strftime('%w') | int in range(1, 6) %}
  false
{# Si mañana no hay ningún evento en "festivos_escolares", true, hay cole #}
{% elif not agenda_calendario["calendar.festivos_escolares"]["events"] %}
  true
{% else %}
  {% for event in agenda_calendario["calendar.festivos_escolares"]["events"] %}
    {% set event_end = as_timestamp(strptime(event.end, "%Y-%m-%d")) %}
    {# Si para mañana se ha terminado el evento, true, hay cole #}
    {% if tomorrow &gt; event_end %}
      true
      {% break %}
    {% else %}
      false
    {% endif %}
  {% endfor %}
{% endif %}
</pre>
</div>
<hr />
</div>
</div>
<div id="outline-container-org98a2094" class="outline-3">
<h3 id="org98a2094"><span class="section-number-3">7.4.</span> Las persianas de casa</h3>
<div class="outline-text-3" id="text-7-4">
</div>
<div id="outline-container-org5949460" class="outline-4">
<h4 id="org5949460"><span class="section-number-4">7.4.1.</span> Bajar las persianas cuando levanta el sol y hace calor</h4>
<div class="outline-text-4" id="text-7-4-1">
<p>
Hay que determinar cuando está levantando el sol y hace el suficiente calor dentro o fuera de casa
</p>
<ul class="org-ul">
<li>Elevación del sol entre 21º y 50º</li>
<li>La hora menor de las 14:00 para despreciar cuando se esconde el sol</li>
<li>Temperatura interior o exterior por encima de 23 ºC</li>
</ul>

<div class="org-src-container">
<pre class="src src-jinja2">{% set elev = 21 &lt; state_attr('sun.sun', 'elevation') &lt; 50 %}
{% set hora = now().hour &lt; 14 %}
{% set exterior_temperature = states('sensor.temperatura_exterior') | float %}
{% set salon_temperature = states('sensor.temperatura_salon') | float %}
{% set temp = exterior_temperature &gt; 23 or salon_temperature &gt; 23 %}
{% set desp = states('weather.aemet') != "cloudy" %}
{{ desp and elev and hora and temp }}
</pre>
</div>
</div>
</div>
<div id="outline-container-org22972a3" class="outline-4">
<h4 id="org22972a3"><span class="section-number-4">7.4.2.</span> Bajar las persianas cuando hace frío y se esconde el sol</h4>
<div class="outline-text-4" id="text-7-4-2">
<div class="org-src-container">
<pre class="src src-jinja2">{% set ta_minima = states('sensor.aemet_daily_forecast_temperature_low') | float %}
{% set sun_elevation = state_attr('sun.sun', 'elevation') %}
{% set exterior_temperature = states('sensor.temperatura_exterior') | float %}
{{ sun_elevation &lt; -5 and now().hour &lt; 22 and (ta_minima &lt; 10 or exterior_temperature &lt; 14) }}
</pre>
</div>
<hr />
</div>
</div>
<div id="outline-container-org1f51c01" class="outline-4">
<h4 id="org1f51c01"><span class="section-number-4">7.4.3.</span> Cuando el sol está entrando por una ventana</h4>
<div class="outline-text-4" id="text-7-4-3">
<p>
En función de la altura del sol, el acimut, la consigna de temperatura de la caldera  y la temperatura exterior, esta plantilla devuelve verdadero cuando el sol está entrando por una ventana.
</p>
<div class="org-src-container">
<pre class="src src-jinja">{% set cal = state_attr('climate.caldera', 'temperature' ) + 4 %}
{% set temp = states('sensor.temperatura_exterior')|int %}
{% set ele = state_attr('sun.sun', 'elevation') %}
{% set azi = state_attr('sun.sun', 'azimuth') %}
{{ temp &gt; cal and azi &gt; 230 and ele &gt; 45 }}
</pre>
</div>
<hr />
</div>
</div>
</div>
