public_html/jinja.html
<div id="outline-container-org0b00246" class="outline-3">
<h3 id="org0b00246"><span class="section-number-3">7.5.</span> Dispositivos Zigbee no disponibles</h3>
<div class="outline-text-3" id="text-7-5">
<p>
Es importante saber cuando algún dispositivo Zigbee no está disponible, para ello utilizo el siguiente script
</p>

<div class="org-src-container">
<pre class="src src-jinja2">{% set zha_entities = integration_entities('zha') %}
{% set mqtt_entities = integration_entities('mqtt') %}
{% set zigbee_entities = zha_entities + mqtt_entities %}
{% set zigbee = namespace(unavailable=[]) %}

{% for entity in zigbee_entities %}
  {% if states(entity) == 'unavailable' %}
    {% set nombre = device_attr(device_id(entity), 'name_by_user') %}
    {% if nombre not in zigbee.unavailable %}
      {% set zigbee.unavailable = zigbee.unavailable + [nombre] %}
    {% endif %}
  {% endif %}
{% endfor %}
{{ zigbee.unavailable | length }}
</pre>
</div>

<p>
Tengo activas dos integraciones con las que controlo dispositivos zigbee, "zha" y "mqtt" por lo que habrá que buscar entidades no disponibles en ambas.
</p>
<hr />
</div>
</div>
<div id="outline-container-orgf15a1af" class="outline-3">
<h3 id="orgf15a1af"><span class="section-number-3">7.6.</span> Calcular el ahorro en la factura de la luz según la hora</h3>
<div class="outline-text-3" id="text-7-6">
<p>
Partimos de la integración "Spain electricity hourly pricing (PVPC)" que nos genera la entidad "sensor.esios<sub>pvpc</sub>" que entre otros tiene los siguientes atributos:
</p>

<ul class="org-ul">
<li>price<sub>00h</sub>: 0.06117</li>
<li>price<sub>01h</sub>: 0.05735</li>
<li>price<sub>02h</sub>: 0.05798</li>
<li>price<sub>03h</sub>: 0.05663</li>
<li>price<sub>04h</sub>: 0.05656</li>
<li>&#x2026;</li>
</ul>

<p>
A partir de aquí generaremos una lista con todos los precios según la hora del día y calcularemos el ahorro porcentual de la hora actual en función del precio máximo y mínimo de la energía en el día.
</p>

<div class="org-src-container">
<pre class="src src-jinja">{% set precios = namespace(numbers=[]) %}
{% for hora in range(0, 24) %}
  {% set key = 'price_' ~ '{:02d}'.format(hora) ~ 'h' %}
  {% set precio = state_attr ('sensor.esios_pvpc', key) %}
  {% set precios.numbers = precios.numbers + [precio] %}
{% endfor %}

{% set max_ahorro = precios.numbers | max - precios.numbers | min %}
{% set now_ahorro = precios.numbers | max - precios.numbers[now().hour] %}
{% set ahorro = ((now_ahorro * 100)/max_ahorro) | int%}

{{ ahorro }}
</pre>
</div>
<hr />
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-01-14</p>
<p class="author">Author: Sherlockes</p>
<p class="date">Created: 2026-03-20 vie 12:57</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
