content/notas/jinja.md


### Dispositivos Zigbee no disponibles {#dispositivos-zigbee-no-disponibles}

Es importante saber cuando algún dispositivo Zigbee no está disponible, para ello utilizo el siguiente script

```jinja2
{% set zha_entities = integration_entities('zha') %}
{% set mqtt_entities = integration_entities('mqtt') %}
{% set zigbee_entities = zha_entities + mqtt_entities %}
{% set zigbee = namespace(unavailable=[]) %}

{% for entity in zigbee_entities %}
  {% if states(entity) == 'unavailable' %}
    {% set nombre = device_attr(device_id(entity), 'name_by_user') %}
    {% if nombre not in zigbee.unavailable %}
      {% set zigbee.unavailable = zigbee.unavailable + [nombre] %}
    {% endif %}
  {% endif %}
{% endfor %}
{{ zigbee.unavailable | length }}
```

Tengo activas dos integraciones con las que controlo dispositivos zigbee, "zha" y "mqtt" por lo que habrá que buscar entidades no disponibles en ambas.

---


### Calcular el ahorro en la factura de la luz según la hora {#calcular-el-ahorro-en-la-factura-de-la-luz-según-la-hora}

Partimos de la integración "Spain electricity hourly pricing (PVPC)" que nos genera la entidad "sensor.esios_pvpc" que entre otros tiene los siguientes atributos:

-   price_00h: 0.06117
-   price_01h: 0.05735
-   price_02h: 0.05798
-   price_03h: 0.05663
-   price_04h: 0.05656
-   ...

A partir de aquí generaremos una lista con todos los precios según la hora del día y calcularemos el ahorro porcentual de la hora actual en función del precio máximo y mínimo de la energía en el día.

```jinja
{% set precios = namespace(numbers=[]) %}
{% for hora in range(0, 24) %}
  {% set key = 'price_' ~ '{:02d}'.format(hora) ~ 'h' %}
  {% set precio = state_attr ('sensor.esios_pvpc', key) %}
  {% set precios.numbers = precios.numbers + [precio] %}
{% endfor %}

{% set max_ahorro = precios.numbers | max - precios.numbers | min %}
{% set now_ahorro = precios.numbers | max - precios.numbers[now().hour] %}
{% set ahorro = ((now_ahorro * 100)/max_ahorro) | int%}

{{ ahorro }}
```

---
